# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [5, 7, 10, 13, 16, 20] # P3/4 (smaller anchors for better small object detection)
  - [20, 28, 30, 35, 40, 50] # P4/8 (medium objects)
  - [50, 70, 80, 90, 120, 150] # P5/16 (fewer large-object anchors)

# YOLOv5 small-object optimized backbone
backbone:
  [
    [-1, 1, Conv, [64, 3, 1, 1]],  # 0-P1/1 (was 6x6, changed to 3x3)
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/2 (less aggressive downsampling)
    [-1, 4, C3, [128]],  # More feature extraction
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/4 (was P3/8)
    [-1, 6, C3, [256]],  # Deeper feature extraction
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/8 (was P4/16)
    [-1, 9, C3, [512]],  # More layers for better small object learning
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/16 (was P5/32)
    [-1, 4, C3, [1024]],  # Additional depth for refining feature extraction
    [-1, 1, SPPF, [1024, 3]],  # 9 (was 5x5, reduced to 3x3 for finer details)
  ]
  
# YOLOv5 small-object optimized head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 4, C3, [512, False]], # 13 (was 3 layers, now 4 for deeper small object learning)

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 4, C3, [256, False]], # 17 (P3/4-small, deeper for small objects)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 4, C3, [512, False]], # 20 (P4/8-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 23 (P5/16-large, fewer layers)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
