
# Parameters
nc: 80  # number of classes (update to your dataset)
depth_multiple: 1.0  # model depth multiplier
width_multiple: 1.0  # layer channel multiplier

anchors:
  - [1, 3, 4, 6, 8, 12]   # More finely tuned anchors for P2/4, adjusted based on dataset analysis
  - [10, 13, 16, 30, 33, 23]     
  - [30, 61, 62, 45, 59, 119]    
  - [116, 90, 156, 198, 373, 326]


backbone:
  [
    [-1, 1, Conv, [64, 6, 2, 2]],  # Increase the kernel size or number of filters
    [-1, 1, Conv, [128, 3, 2]],    # Key layer for small objects
    [-1, 4, C3, [128]],            # Increased from 3 to 4 C3 blocks for better feature extraction
    [-1, 1, Conv, [256, 3, 2]],    
    [-1, 6, C3, [256]],            
    [-1, 1, Conv, [512, 3, 2]],    
    [-1, 9, C3, [512]],            
    [-1, 1, Conv, [1024, 3, 2]],   
    [-1, 3, C3, [1024]],           
    [-1, 1, SPPF, [1024, 5]],      
  ]


head:
  [
    [-1, 1, Conv, [512, 1, 1]],                    
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],    
    [[-1, 6], 1, Concat, [1]],                     
    [-1, 3, C3, [512, False]],                     

    [-1, 1, Conv, [256, 1, 1]],                    
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],    
    [[-1, 4], 1, Concat, [1]],                     
    [-1, 3, C3, [256, False]],                     

    [-1, 1, Conv, [128, 1, 1]],                    
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],    
    [[-1, 1], 1, Concat, [1]],                     # Change to concatenate from P1 for better small object features
    [-1, 3, C3, [128, False]],                     # Enhanced small object detection layer

    [-1, 1, Conv, [128, 3, 2]],                    
    [[-1, 17], 1, Concat, [1]],                    
    [-1, 3, C3, [256, False]],                     

    [-1, 1, Conv, [256, 3, 2]],                    
    [[-1, 13], 1, Concat, [1]],                    
    [-1, 3, C3, [512, False]],                     

    [-1, 1, Conv, [512, 3, 2]],                    
    [[-1, 9], 1, Concat, [1]],                     
    [-1, 3, C3, [1024, False]],                   

    [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Enhanced to include more detection layers
  ]
